{
  "build_config": {
    "input_shape": [
      null,
      100
    ]
  },
  "class_name": "Functional",
  "compile_config": {
    "optimizer": "adam",
    "loss": "categorical_crossentropy",
    "metrics": [
      "accuracy"
    ],
    "loss_weights": null,
    "weighted_metrics": null,
    "run_eagerly": null,
    "steps_per_execution": null,
    "jit_compile": null
  },
  "config": {
    "name": "model_4",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            100
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_5"
        },
        "registered_name": null,
        "name": "input_5",
        "inbound_nodes": []
      },
      {
        "module": "keras.layers",
        "class_name": "Embedding",
        "config": {
          "name": "embedding_4",
          "trainable": false,
          "dtype": "float32",
          "batch_input_shape": [
            null,
            null
          ],
          "input_dim": 4479,
          "output_dim": 300,
          "embeddings_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            },
            "registered_name": null
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": false,
          "input_length": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            100
          ]
        },
        "name": "embedding_4",
        "inbound_nodes": [
          [
            [
              "input_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "SpatialDropout1D",
        "config": {
          "name": "spatial_dropout1d_4",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            100,
            300
          ]
        },
        "name": "spatial_dropout1d_4",
        "inbound_nodes": [
          [
            [
              "embedding_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_4",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            2
          ],
          "strides": [
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            100,
            300
          ]
        },
        "name": "conv1d_4",
        "inbound_nodes": [
          [
            [
              "spatial_dropout1d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Bidirectional",
        "config": {
          "name": "bidirectional_4",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "module": "keras.layers",
            "class_name": "LSTM",
            "config": {
              "name": "lstm_4",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null,
                "shared_object_id": 133414118727568
              },
              "recurrent_initializer": {
                "module": "keras.initializers",
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                },
                "registered_name": null,
                "shared_object_id": 133414118727664
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null,
                "shared_object_id": 133414118727760
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.2,
              "recurrent_dropout": 0.1,
              "implementation": 1
            },
            "registered_name": null
          },
          "merge_mode": "concat"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            99,
            64
          ]
        },
        "name": "bidirectional_4",
        "inbound_nodes": [
          [
            [
              "conv1d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "GlobalAveragePooling1D",
        "config": {
          "name": "global_average_pooling1d_4",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last",
          "keepdims": false
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            99,
            256
          ]
        },
        "name": "global_average_pooling1d_4",
        "inbound_nodes": [
          [
            [
              "bidirectional_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_8",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            256
          ]
        },
        "name": "dense_8",
        "inbound_nodes": [
          [
            [
              "global_average_pooling1d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            128
          ]
        },
        "name": "dropout_4",
        "inbound_nodes": [
          [
            [
              "dense_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_9",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            128
          ]
        },
        "name": "dense_9",
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_5",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_9",
        0,
        0
      ]
    ]
  },
  "module": "keras.src.engine.functional",
  "registered_name": "Functional"
}